import image_1 from "@/public/images/blog/mag_1.jpg";
import image_2 from "@/public/images/blog/mag_2.jpg";
import image_3 from "@/public/images/blog/mag_3.jpg";
import image_4 from "@/public/images/blog/mag_4.jpg";

export const magazines = [
  {
    id: 1,
    author: "نویسنده ۱",
    title: "تجربه لوکس با ساعت‌های مچی سوئیسی",
    shortDesc: "بررسی دقیق‌ترین و خاص‌ترین ساعت‌های مچی سوئیسی",
    longDesc:
      "در این شماره، دنیای ساعت‌های مچی سوئیسی را کاوش می‌کنیم. از برندهای شناخته‌شده‌ای مانند رولکس و امگا گرفته تا سازندگان مستقل و باسابقه، ما به بررسی ویژگی‌ها، عملکردها و جذابیت‌های منحصر به فرد این ساعت‌های لوکس می‌پردازیم. با خواندن این مقاله، می‌توانید اطلاعات ارزشمندی در مورد موتورهای مکانیکی پیچیده، مواد باکیفیت و طراحی‌های بی‌نظیر ساعت‌های سوئیسی به دست آورید.",
    image: image_1,
    dateCreated: "1999-12-23",
  },
  {
    id: 2,
    author: "نویسنده ۲",
    title: "فراتر از زمان: کاوش در دنیای ساعت‌های هوشمند",
    shortDesc: "آشنایی با جدیدترین قابلیت‌ها و فناوری‌های ساعت‌های هوشمند",
    longDesc:
      "ساعت‌های هوشمند دیگر فقط برای نمایش زمان نیستند. این گجت‌های پوشیدنی باهوش، طیف وسیعی از ویژگی‌ها را ارائه می‌دهند که زندگی روزمره شما را آسان‌تر می‌کنند. در این مقاله، به بررسی جدیدترین قابلیت‌های ساعت‌های هوشمند مانند ردیابی فعالیت، پرداخت بدون تماس، GPS داخلی و موارد دیگر می‌پردازیم. همچنین به مقایسه محبوب‌ترین برندهای ساعت هوشمند مانند اپل واچ، سامسونگ گلکسی واچ و فسیل می‌پردازیم تا به شما در انتخاب بهترین گزینه کمک کنیم.",
    image: image_2,
    dateCreated: "2001-05-15",
  },
  {
    id: 3,
    author: "نویسنده ۳",
    title: "سبک کلاسیک و اصیل: راهنمای خرید ساعت‌های جیبی",
    shortDesc: "همه چیز در مورد انتخاب، نگهداری و استفاده از ساعت‌های جیبی",
    longDesc:
      "ساعت‌های جیبی، زمانی یک وسیله ضروری برای ردیابی زمان بودند، امروزه به یک نماد از سبک کلاسیک و اصالت تبدیل شده‌اند. در این مقاله، راهنمای جامعی برای خرید ساعت‌های جیبی ارائه می‌دهیم. ما به انواع موتورها، جنس‌های بدنه، سبک‌های طراحی و ویژگی‌های مختلف ساعت‌های جیبی می‌پردازیم. همچنین نکات مفیدی در مورد نگهداری و استفاده صحیح از این ساعت‌های زیبا ارائه می‌دهیم.",
    image: image_3,
    dateCreated: "2010-08-30",
  },
  {
    id: 4,
    author: "نویسنده ۴",
    title: "دنیای رنگارنگ: ساعت‌های دیواری برای هر سلیقه‌ای",
    shortDesc: "انتخاب و نصب ساعت دیواری مناسب برای دکوراسیون منزل شما",
    longDesc:
      "ساعت‌های دیواری فراتر از یک وسیله برای نمایش زمان هستند. آن‌ها می‌توانند به عنوان یک عنصر تزئینی زیبا در منزل شما عمل کنند. در این مقاله، به شما کمک می‌کنیم تا ساعت دیواری مناسب برای سبک دکوراسیون منزل خود را انتخاب کنید. ما به انواع مواد، اندازه‌ها، رنگ‌ها و سبک‌های ساعت‌های دیواری می‌پردازیم. همچنین نکات مفیدی در مورد نصب صحیح ساعت دیواری بر روی دیوار ارائه می‌دهیم.",
    image: image_4,
    dateCreated: "2018-03-10",
  },
];

export const news = [
  {
    id: 1,
    author: "طراح زمان (Designer of Time)",
    title: "رونمایی از شاهکار زمان‌سنجی: مجموعه‌ی جدید ساعت‌های [نام برند شما]",
    shortDesc:
      "کمپانی [نام برند شما] با افتخار از مجموعه‌ی جدید و خیره‌کننده‌ی ساعت‌های خود رونمایی می‌کند که دنیایی از ظرافت، عملکرد و نوآوری را به همراه دارد.", // Short description
    longDesc:
      "این مجموعه‌ی جدید شامل طیف وسیعی از ساعت‌های مچی با طراحی‌های منحصر به فرد و چشم‌نواز است که برای هر سلیقه‌ای مناسب می‌باشد. ساعت‌های این مجموعه با استفاده از مرغوب‌ترین متریال و با بهره‌گیری از تکنولوژی‌های پیشرفته ساخته شده‌اند تا عملکردی بی‌نقص و تجربه‌ای لوکس را برای شما به ارمغان آورند.  مجموعه‌ی جدید [نام برند شما] نشان‌دهنده‌ی تعهد ما به کیفیت، نوآوری و میراث طولانی‌مدت ما در صنعت ساعت‌سازی است. برای کسب اطلاعات بیشتر و کشف ساعت رویایی خود، از وب‌سایت ما دیدن فرمایید.", // Long description - Replace with your brand name
    image: image_1,
    dateCreated: "2024-05-13",
  },
  {
    id: 2,
    author: "عاشق زمان (Time Lover)",
    title: "راهنمای انتخاب ساعت مناسب: برای هر استایلی ساعتی وجود دارد",
    shortDesc:
      "انتخاب ساعت مناسب می‌تواند نقش مهمی در تکمیل استایل شما داشته باشد. در این مقاله، راهنمایی جامع برای انتخاب ساعت بر اساس سبک و نیازهایتان به شما ارائه می‌دهیم.", // Short description
    longDesc:
      "چه به دنبال یک ساعت لوکس و رسمی برای جلسات کاری باشید، چه ساعتی اسپرت برای فعالیت‌های روزمره، یا ساعتی کلاسیک و همیشگی، در دنیای ساعت‌ها گزینه‌ی ایده‌آلی برای شما وجود دارد. در این راهنما، به انواع مختلف ساعت‌ها، ویژگی‌های کلیدی آن‌ها و نکاتی برای ست کردن ساعت با لباس‌هایتان می‌پردازیم. با مطالعه‌ی این مقاله، به راحتی قادر خواهید بود ساعت مناسب خود را انتخاب کنید و استایلتان را ارتقا دهید.", // Long description
    image: image_2,
    dateCreated: "2024-05-12",
  },
  {
    id: 3,
    author: "نگهبان زمان (Timekeeper)",
    title: "مراقبت و نگه‌داری از ساعت: عمر ساعت خود را طولانی‌تر کنید",
    shortDesc:
      "ساعت شما یک سرمایه‌گذاری ارزشمند است. با مراقبت و نگه‌داری صحیح، می‌توانید طول عمر آن را افزایش دهید و درخشش و عملکرد بی‌نقص آن را برای سال‌های آینده حفظ نمایید.", // Short description
    longDesc:
      "چند نکته‌ی ساده برای مراقبت از ساعت شما وجود دارد که می‌تواند به طور قابل توجهی بر طول عمر آن بیافزاید. از تمیز کردن و نگهداری منظم گرفته تا محافظت از آن در برابر ضربه و آب، با رعایت این نکات می‌توانید اطمینان حاصل کنید که ساعت شما همواره در بهترین وضعیت خود باقی می‌ماند. در این مقاله، به روش‌های مختلف مراقبت و نگه‌داری از ساعت می‌پردازیم تا بتوانید از این همراه همیشگی به خوبی محافظت کنید.", // Long description
    image: image_3,
    dateCreated: "2024-05-11",
  },
];
